## Plan Result (demo-global)




<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;div-dn&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;dss-update-case&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;rpts&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo"
        name                                 = "hmcts-demo"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-da" -> "healthProbeSettings-dss-update-case"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/div-da"
          ~ load_balancing_name = "loadBalancingSettings-div-da" -> "loadBalancingSettings-dss-update-case"
          ~ name                = "div-da" -> "dss-update-case"

          ~ backend {
              ~ address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> "firewall-nonprodi-palo-cftapimgmtdemo.uksouth.cloudapp.azure.com"
              ~ host_header = "decree-absolute-aks.demo.platform.hmcts.net" -> "dss-update-case.demo.platform.hmcts.net"
                # (5 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-rfe" -> "healthProbeSettings-rpts"
            id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/div-rfe"
          ~ load_balancing_name = "loadBalancingSettings-div-rfe" -> "loadBalancingSettings-rpts"
          ~ name                = "div-rfe" -> "rpts"

          ~ backend {
              ~ host_header = "respond-divorce-aks.demo.platform.hmcts.net" -> "rpts.demo.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-div-pfe" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/div-pfe" -> null
          - load_balancing_name = "loadBalancingSettings-div-pfe" -> null
          - name                = "div-pfe" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "petitioner-frontend-aks.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-sscs-tribunals" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/sscs-tribunals" -> null
          - load_balancing_name = "loadBalancingSettings-sscs-tribunals" -> null
          - name                = "sscs-tribunals" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "benefit-appeal.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-sscs-cor" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/sscs-cor" -> null
          - load_balancing_name = "loadBalancingSettings-sscs-cor" -> null
          - name                = "sscs-cor" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "sscs-cor.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-sscs-tya" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/sscs-tya" -> null
          - load_balancing_name = "loadBalancingSettings-sscs-tya" -> null
          - name                = "sscs-tya" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "track-appeal.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-xui-webapp" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-webapp" -> null
          - load_balancing_name = "loadBalancingSettings-xui-webapp" -> null
          - name                = "xui-webapp" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "manage-case.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-xui-manage-org" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-manage-org" -> null
          - load_balancing_name = "loadBalancingSettings-xui-manage-org" -> null
          - name                = "xui-manage-org" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "manage-org.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-xui-manage-org-int" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-manage-org-int" -> null
          - load_balancing_name = "loadBalancingSettings-xui-manage-org-int" -> null
          - name                = "xui-manage-org-int" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "manage-org-int.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-xui-approve-org" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-approve-org" -> null
          - load_balancing_name = "loadBalancingSettings-xui-approve-org" -> null
          - name                = "xui-approve-org" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "administer-orgs.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-fact" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/fact" -> null
          - load_balancing_name = "loadBalancingSettings-fact" -> null
          - name                = "fact" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "fact.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-xui-approve-org-int" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-approve-org-int" -> null
          - load_balancing_name = "loadBalancingSettings-xui-approve-org-int" -> null
          - name                = "xui-approve-org-int" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "administer-orgs-int.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-fact-admin" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/fact-admin" -> null
          - load_balancing_name = "loadBalancingSettings-fact-admin" -> null
          - name                = "fact-admin" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "fact-admin.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-et-sya" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/et-sya" -> null
          - load_balancing_name = "loadBalancingSettings-et-sya" -> null
          - name                = "et-sya" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "et-sya.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-gateway-ccd" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/gateway-ccd" -> null
          - load_balancing_name = "loadBalancingSettings-gateway-ccd" -> null
          - name                = "gateway-ccd" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "gateway-ccd.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-gateway-ccd-int" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/gateway-ccd-int" -> null
          - load_balancing_name = "loadBalancingSettings-gateway-ccd-int" -> null
          - name                = "gateway-ccd-int" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "gateway-ccd-int.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-xui-register-org" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/xui-register-org" -> null
          - load_balancing_name = "loadBalancingSettings-xui-register-org" -> null
          - name                = "xui-register-org" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "register-org.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-ac-int-gateway-ccd" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/ac-int-gateway-ccd" -> null
          - load_balancing_name = "loadBalancingSettings-ac-int-gateway-ccd" -> null
          - name                = "ac-int-gateway-ccd" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "ac-int-gateway-ccd.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-pcq" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/pcq" -> null
          - load_balancing_name = "loadBalancingSettings-pcq" -> null
          - name                = "pcq" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "pcq.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-pcq-int" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/pcq-int" -> null
          - load_balancing_name = "loadBalancingSettings-pcq-int" -> null
          - name                = "pcq-int" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "pcq-int.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-lau" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/lau" -> null
          - load_balancing_name = "loadBalancingSettings-lau" -> null
          - name                = "lau" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> null
              - host_header = "lau.demo.platform.hmcts.net" -> null
              - http_port   = 80 -> null
              - https_port  = 443 -> null
              - priority    = 1 -> null
              - weight      = 50 -> null
            }
        }
      - backend_pool {
          - health_probe_name   = "healthProbeSettings-lau-int" -> null
          - id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/backendPools/lau-int" -> null
          - load_balancing_name = "loadBalancingSettings-lau-int" -> null
          - name                = "lau-int" -> null

          - backend {
              - address     = "firewall-nonprodi-palo-cftdemoappgateway.uksouth.cloudapp.azure.com" -> null
              - enabled     = true -> 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

atch  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "adoption-web",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/adoption-webHttpsRedirect" -> null
          - name               = "adoption-webHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "probate",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/probateHttpsRedirect" -> null
          - name               = "probateHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "idam-web-public",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/idam-web-publicHttpsRedirect" -> null
          - name               = "idam-web-publicHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "hmcts-access",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/hmcts-accessHttpsRedirect" -> null
          - name               = "hmcts-accessHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "paybubble",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paybubbleHttpsRedirect" -> null
          - name               = "paybubbleHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "paybubble-int",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paybubble-intHttpsRedirect" -> null
          - name               = "paybubble-intHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "bar",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/barHttpsRedirect" -> null
          - name               = "barHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "bar-int",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/bar-intHttpsRedirect" -> null
          - name               = "bar-intHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              31m- redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "fees-register",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/fees-registerHttpsRedirect" -> null
          - name               = "fees-registerHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "fees-register-int",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/fees-register-intHttpsRedirect" -> null
          - name               = "fees-register-intHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "idam-web-admin",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/idam-web-adminHttpsRedirect" -> null
          - name               = "idam-web-adminHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "idam-user-dashboard",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/idam-user-dashboardHttpsRedirect" -> null
          - name               = "idam-user-dashboardHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "ds-ui",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/ds-uiHttpsRedirect" -> null
          - name               = "ds-uiHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "sptribs-frontend",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/sptribs-frontendHttpsRedirect" -> null
          - name               = "sptribs-frontendHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "privatelaw",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/privatelawHttpsRedirect" -> null
          - name               = "privatelawHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "paymentoutcome-web",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paymentoutcome-webHttpsRedirect" -> null
          - name               = "paymentoutcome-webHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "paymentoutcome-web-int",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paymentoutcome-web-intHttpsRedirect" -> null
          - name               = "paymentoutcome-web-intHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "fis-ds-update-web",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/fis-ds-update-webHttpsRedirect" -> null
          - name               = "fis-ds-update-webHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "fis-ds-web",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/fis-ds-webHttpsRedirect" -> null
          - name               = "fis-ds-webHttpsRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
              - "Https",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "wwwpaymentoutcome-web",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paymentoutcome-webwwwRedirect" -> null
          - name               = "paymentoutcome-webwwwRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - custom_host       = "paymentoutcome-web.demo.platform.hmcts.net" -> null
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      - routing_rule {
          - accepted_protocols = [
              - "Http",
              - "Https",
            ] -> null
          - enabled            = true -> null
          - frontend_endpoints = [
              - "wwwpaymentoutcome-web-int",
            ] -> null
          - id                 = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/routingRules/paymentoutcome-web-intwwwRedirect" -> null
          - name               = "paymentoutcome-web-intwwwRedirect" -> null
          - patterns_to_match  = [
              - "/*",
            ] -> null

          - redirect_configuration {
              - custom_host       = "paymentoutcome-web-int.demo.platform.hmcts.net" -> null
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }

        # (31 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["div-dn"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/div-dn"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["dss-update-case"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/dss-update-case"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["rpts"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo/frontendEndpoints/rpts"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/lz-demo-rg/providers/Microsoft.Network/frontDoors/hmcts-demo|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1472,"Program":"tfcmt","SHA1":"","Target":"demo-global","Vars":{}} -->